OpenFoam_Demo/cavity/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    back
    {
        type            empty;
        
      
    }
    front
    {
        type            empty;
      
      
    }
    top
    {
        type            noSlip;
        
        
    }
    in
    {
        type            fixedValue;
        value           uniform (1 0 0);
       
    }
    bottom
    {
        type            noSlip;
        
       
    }
    out
    {
        type            zeroGradient;
       
        
    }
    square
    {
        type            noSlip;
        
        
    }
}

// ************************************************************************* //
