OpenFoam_Demo/cavity/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    back
    {
        type            empty;
        
      
    }
    front
    {
        type            empty;
      
      
    }
    top
    {
        type            zeroGradient;
        
        
    }
    in
    {
        type            zeroGradient;
        
    }
    bottom
    {
        type            zeroGradient;
        
       
    }
    out
    {
        type            fixedValue;
        value           uniform 0;
        
    }
    square
    {
        type            zeroGradient;
        
        
    }
}

// ************************************************************************* //
